In [1]:
import pandas as pd
import numpy as np

# Series

In [11]:
# Series com listas

numeros = pd.Series([1,2,3,4,5,6,7,8,9,10,11,12])

numeros

0      1
1      2
2      3
3      4
4      5
5      6
6      7
7      8
8      9
9     10
10    11
11    12
dtype: int64

In [12]:
type(numeros)

pandas.core.series.Series

In [13]:
numeros.index

RangeIndex(start=0, stop=12, step=1)

In [6]:
meses = ['Janeiro','Fevereiro','Março','Abril','Maio','Junho','Julho','Agosto','Setembro','Outubro','Novembro','Dezembro']

In [7]:
meses_sr = pd.Series(np.arange(1, 13), index = meses)
meses_sr

Janeiro       1
Fevereiro     2
Março         3
Abril         4
Maio          5
Junho         6
Julho         7
Agosto        8
Setembro      9
Outubro      10
Novembro     11
Dezembro     12
dtype: int32

In [8]:
meses_sr.index

Index(['Janeiro', 'Fevereiro', 'Março', 'Abril', 'Maio', 'Junho', 'Julho',
       'Agosto', 'Setembro', 'Outubro', 'Novembro', 'Dezembro'],
      dtype='object')

Series com dicionários

In [27]:
# Criando séries através de um dicionário - As chaves passam os índices

world_cup = {'Brasil':5,'Alemanha':4,'Italia':4,'Argentina':2,'Uruguai':2,'Inglaterra':1,'França':1}

In [18]:
world_cup_sr = pd.Series(world_cup)
world_cup_sr

Brasil        5
Alemanha      4
Itealia       4
Argentina     2
Uruguai       2
Inglaterra    1
França        1
dtype: int64

In [28]:
# Criando uma série e definindo um índice

world_cup = {'Brasil':5,'Alemanha':4,'Italia':4,'Argentina':2,'Uruguai':2,'Inglaterra':1,'França':1}

In [29]:
world_cup_sr = pd.Series(world_cup, 
                         index = ['Brasil','Alemanha','Italia','Argentina','Uruguai','Inglaterra','Espanha'],
                         name = 'wcSeries')

In [30]:
# Observe o valor nulo

world_cup_sr

Brasil        5.0
Alemanha      4.0
Italia        4.0
Argentina     2.0
Uruguai       2.0
Inglaterra    1.0
Espanha       NaN
Name: wcSeries, dtype: float64

In [31]:
world_cup_sr.index

Index(['Brasil', 'Alemanha', 'Italia', 'Argentina', 'Uruguai', 'Inglaterra',
       'Espanha'],
      dtype='object')

In [32]:
#Trazendo a variavel através do indice (nome da coluna)

world_cup_sr['Brasil']

5.0

In [34]:
# Ou pegando o indice geral que o Python gera na lista

world_cup_sr[0]

5.0

In [24]:
# Atribuição de valor, pode ser feita pelo nome do indice (coluna) ou pelo número

world_cup_sr['Espanha'] = 1

world_cup_sr

Brasil        5.0
Alemanha      4.0
Itealia       4.0
Argentina     2.0
Uruguai       2.0
Inglaterra    1.0
Espanha       1.0
Name: wcSeries, dtype: float64

In [25]:
# Ao trabalharmos com índices númericos podemos fazer slices assim como nas listas e vetores

world_cup_sr[1:3]

Alemanha    4.0
Itealia     4.0
Name: wcSeries, dtype: float64

In [26]:
# Podemos realizar comparções lógicas

world_cup_sr[world_cup_sr > 3]

Brasil      5.0
Alemanha    4.0
Itealia     4.0
Name: wcSeries, dtype: float64

# Leitura de arquivos em excel

In [35]:
arquivo = 'C:\\Users\\nelson.junior\\OneDrive\\Python Scripts\\Curso Uni_dados_Dta_Science\\Alunos.xlsx'


# Carregando arquivo
xls = pd.ExcelFile(arquivo)

# Verificandoa planilha
print(xls.sheet_names)

['Alunos', 'Notas', 'Trimestre']

In [36]:
# Carregando a planilha na variável alunos

alunos = xls.parse('Alunos')

alunos.head()

   Alunos
0     Ana
1   Clara
2   Célia
3    João
4  Carlos

In [37]:
type(alunos)

pandas.core.frame.DataFrame

In [49]:
# Dot notation 'não funciona com espaços'.

alunos[:1]

  Alunos Sobrenome  Mês 01  Mês 02  Mês 03
0    Ana    Santos     5.7     6.8     4.6

# Dot Notation x Colchetes

In [44]:
alunos = xls.parse('Trimestre')

alunos.head()

   Alunos  Sobrenome  Mês 01  Mês 02  Mês 03
0     Ana     Santos     5.7     6.8     4.6
1   Clara      Mafra     9.9     7.0     9.0
2   Célia    Tavares     8.0     8.0     9.0
3    João      Nunes     9.9     9.0     8.0
4  Carlos  Guilherme     7.0     7.5     6.0

In [48]:
alunos['Mês 01'][1]

9.9

In [47]:
# utilize o tab

alunos.Alunos

0        Ana
1      Clara
2      Célia
3       João
4     Carlos
5      Jorge
6     Lilian
7    Antônio
Name: Alunos, dtype: object

In [53]:
#verificando o índice

alunos.index

RangeIndex(start=0, stop=8, step=1)

In [54]:
# verificando o tamanho

alunos.shape

(8, 5)

In [55]:
# verificando as colunas

alunos.columns

Index(['Alunos', 'Sobrenome', 'Mês 01', 'Mês 02', 'Mês 03'], dtype='object')

# Criando uma nova série em um dataframe

In [56]:
# Criando uma série formato Python

'João' + ' ' +'Nunes'

'João Nunes'

In [58]:
# Com colchetes
alunos['Nome completo'] = alunos['Alunos'] + ' ' + alunos['Sobrenome']

In [59]:
alunos

    Alunos  Sobrenome  Mês 01  Mês 02  Mês 03     Nome completo
0      Ana     Santos     5.7     6.8     4.6        Ana Santos
1    Clara      Mafra     9.9     7.0     9.0       Clara Mafra
2    Célia    Tavares     8.0     8.0     9.0     Célia Tavares
3     João      Nunes     9.9     9.0     8.0        João Nunes
4   Carlos  Guilherme     7.0     7.5     6.0  Carlos Guilherme
5    Jorge      Silva     6.8     7.0     5.0       Jorge Silva
6   Lilian     Vianna     7.8     8.0     8.5     Lilian Vianna
7  Antônio      Costa     7.0     6.5     6.0     Antônio Costa

In [60]:
# Usando dot notation

alunos['Nome Completo'] = alunos.Alunos + ' ' + alunos.Sobrenome

In [61]:
alunos

,Alunos,Sobrenome,Mês 01,Mês 02,Mês 03,Nome completo,Nome Completo
0,Ana,Santos,5.7,6.8,4.6,Ana Santos,Ana Santos
1,Clara,Mafra,9.9,7.0,9.0,Clara Mafra,Clara Mafra
2,Célia,Tavares,8.0,8.0,9.0,Célia Tavares,Célia Tavares
3,João,Nunes,9.9,9.0,8.0,João Nunes,João Nunes
4,Carlos,Guilherme,7.0,7.5,6.0,Carlos Guilherme,Carlos Guilherme
5,Jorge,Silva,6.8,7.0,5.0,Jorge Silva,Jorge Silva
6,Lilian,Vianna,7.8,8.0,8.5,Lilian Vianna,Lilian Vianna
7,Antônio,Costa,7.0,6.5,6.0,Antônio Costa,Antônio Costa